mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/s6e2c4xj.svd
        <!-- REGISTER "BREG01" -->
        <register>
          <name>BREG01</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x101</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG02" -->
        <register>
          <name>BREG02</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x102</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG03" -->
        <register>
          <name>BREG03</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x103</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG04" -->
        <register>
          <name>BREG04</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG05" -->
        <register>
          <name>BREG05</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG06" -->
        <register>
          <name>BREG06</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG07" -->
        <register>
          <name>BREG07</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x107</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG08" -->
        <register>
          <name>BREG08</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x108</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG09" -->
        <register>
          <name>BREG09</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x109</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0A" -->
        <register>
          <name>BREG0A</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0B" -->
        <register>
          <name>BREG0B</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0C" -->
        <register>
          <name>BREG0C</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0D" -->
        <register>
          <name>BREG0D</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0E" -->
        <register>
          <name>BREG0E</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG0F" -->
        <register>
          <name>BREG0F</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x10F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG10" -->
        <register>
          <name>BREG10</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x110</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG11" -->
        <register>
          <name>BREG11</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x111</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG12" -->
        <register>
          <name>BREG12</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x112</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG13" -->
        <register>
          <name>BREG13</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x113</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG14" -->
        <register>
          <name>BREG14</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x114</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG15" -->
        <register>
          <name>BREG15</name>
          <description>Backup Register [BHW]</description>
          <addressOffset>0x115</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
