mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/s6e2c4xj.svd
        <!-- REGISTER "TXEFC" -->
        <register>
          <name>TXEFC</name>
          <description>Tx Event FIFO Configuration [BHW]</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EFWM" -->
            <field>
              <name>EFWM</name>
              <description>Event FIFO Watermark</description>
              <msb>29</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EFS" -->
            <field>
              <name>EFS</name>
              <description>Event FIFO Size</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EFSA" -->
            <field>
              <name>EFSA</name>
              <description>Event FIFO Start Address</description>
              <msb>15</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFS" -->
        <register>
          <name>TXFS</name>
          <description>Tx Event FIFO Status [BHW]</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x031F1F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TEFL" -->
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFF" -->
            <field>
              <name>EFF</name>
              <description>Event FIFO Full</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFPI" -->
            <field>
              <name>EFPI</name>
              <description>Event FIFO Put Index</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFGI" -->
            <field>
              <name>EFGI</name>
              <description>Event FIFO Get Index</description>
              <msb>12</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFFL" -->
            <field>
              <name>EFFL</name>
              <description>Event FIFO Fill Level</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFA" -->
        <register>
          <name>TXFA</name>
          <description>Tx Event FIFO Acknowledge [BHW]</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EFAI" -->
            <field>
              <name>EFAI</name>
              <description>Event FIFO Acknowledge Index</description>
              <msb>4</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDECR" -->
        <register>
          <name>FDECR</name>
          <description>CAN FD ECC Error Control Register [BHW]</description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEIV" -->
            <field>
              <name>CEIV</name>
              <description>ECC check disable bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CEREN" -->
            <field>
              <name>CEREN</name>
              <description>ECC error response enable bit</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEIE" -->
            <field>
              <name>DEIE</name>
              <description>Double-bit error factor interrupt enable bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEIE" -->
            <field>
              <name>SEIE</name>
              <description>Single-bit error factor interrupt enable bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESR" -->
        <register>
          <name>FDESR</name>
          <description>CAN FD ECC Error Status Register [BHW]</description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEI" -->
            <field>
              <name>DEI</name>
              <description>Double-bit error occurrence bit</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SEI" -->
            <field>
              <name>SEI</name>
              <description>Single-bit error occurrence bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
