mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2c4xj/s6e2c4xj.svd
        <!-- REGISTER "RXFIFO13" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO13</name>
          <description>RX-FIFO13 read data [BHW]</description>
          <addressOffset>0xC4</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO14" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO14</name>
          <description>RX-FIFO14 read data [BHW]</description>
          <addressOffset>0xC8</addressOffset>
        </register>
        <!-- REGISTER "RXFIFO15" -->
        <register derivedFrom="RXFIFO0">
          <name>RXFIFO15</name>
          <description>RX-FIFO15 read data [BHW]</description>
          <addressOffset>0xCC</addressOffset>
        </register>
        <!-- REGISTER "CSCFG" -->
        <register>
          <name>CSCFG</name>
          <description>Command Sequencer Setting Register [BHW]</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0F07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSEL" -->
            <field>
              <name>MSEL</name>
              <description>Memory device selection bits</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL3EN" -->
            <field>
              <name>SSEL3EN</name>
              <description>Slave select 3 enable bit</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL2EN" -->
            <field>
              <name>SSEL2EN</name>
              <description>Slave select 2 enable bit</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL1EN" -->
            <field>
              <name>SSEL1EN</name>
              <description>Slave select 1 enable bit</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL0EN" -->
            <field>
              <name>SSEL0EN</name>
              <description>Slave select 0 enable bit</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MBM" -->
            <field>
              <name>MBM</name>
              <description>SPI data width setting bits</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRAM" -->
            <field>
              <name>SRAM</name>
              <description>Readable/Writable or Read only selection bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSITIME" -->
        <register>
          <name>CSITIME</name>
          <description>Command Sequencer Idle Timer Setting Register [BHW]</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ITIME" -->
            <field>
              <name>ITIME</name>
              <description>Idle timer setting value</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CSAEXT" -->
        <register>
          <name>CSAEXT</name>
          <description>Command Sequencer Address Extension Register [BHW]</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFE000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AEXT" -->
            <field>
              <name>AEXT</name>
              <description>Address extension bits</description>
              <msb>31</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RDCSDC0" -->
        <register>
          <name>RDCSDC0</name>
          <description>Read Command Sequence Data/Control Register 0 [BHW]</description>
          <addressOffset>0xDC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDCSDATA" -->
            <field>
              <name>RDCSDATA</name>
              <description>Read command sequencer data,ontrol setting values</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONT" -->
            <field>
              <name>CONT</name>
              <description>Continuous instruction setting bit</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description>Serial interface width control bits</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEC" -->
            <field>
              <name>DEC</name>
              <description>Decode control bit</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
